{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: rebranding SurvivalGuideSection to 'Timmy & Ricay' and adding a full-screen code entry gate (code: 2112) with sessionStorage persistence.",
  "frontend-file-summaries.txt": "JSON map of frontend file paths to short descriptions summarizing each component's purpose and styling within the Backrooms/Dreamcore themed site.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes used throughout the application.",
  "frontend/index.html": "HTML entry point titled 'Into The Backrooms' with meta/Open Graph tags, Google Fonts imports for Special Elite and Share Tech Mono, and a root div for the React app.",
  "frontend/src/App.tsx": "Root React component that composes the full page layout: CodeEntryGate overlay, NavBar, all content sections (Hero, Backrooms, Levels, Dreamcore, Survival Guide), and Footer.",
  "frontend/src/components/BeforeAfterSlider.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/CodeEntryGate.tsx": "Full-screen Backrooms-styled gate overlay that blocks site access until the user enters code '2112', with sessionStorage persistence, grain/scanline textures, and a glitch animation on wrong input.",
  "frontend/src/components/DreamcoreSection.tsx": "Dreamcore aesthetic section featuring explanatory copy, a 2×2 image grid with hover caption overlays, and scroll-triggered fade-in animations using soft pastel lavender/cyan accents.",
  "frontend/src/components/FAQSection.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/FinalCTASection.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Site footer with 'Into The Backrooms' branding, smooth-scroll navigation links, system status readout, fan project disclaimer, and fluorescent liminal palette styling.",
  "frontend/src/components/GallerySection.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a Backrooms-themed background image, animated title fade-in, flickering fluorescent light effects, and a scroll-down chevron button.",
  "frontend/src/components/HowItWorksSection.tsx": "Empty component file with no content.",
  "frontend/src/components/LevelsSection.tsx": "Displays a catalogue of four Backrooms levels (Level 0, Level 1, Level !, Poolrooms) as cards with images, descriptions, and danger tags, using IntersectionObserver for staggered fade-in animations.",
  "frontend/src/components/NavBar.tsx": "Fixed navigation bar with scroll-aware background blur, smooth-scroll links to page sections, a diamond logo, and a responsive hamburger menu for mobile.",
  "frontend/src/components/ParticleAnimation.tsx": "Canvas-based particle animation that renders rising gold and violet floating particles with fade-in/out lifecycle, used as a decorative background overlay.",
  "frontend/src/components/PricingSection.tsx": "Empty component file with no content.",
  "frontend/src/components/StickyCTA.tsx": "Empty component file with no content.",
  "frontend/src/components/SurvivalGuideSection.tsx": "Renders a numbered list of five Backrooms survival tips attributed to 'Timmy & Ricay', with staggered IntersectionObserver fade-in animations and a fluorescent aesthetic.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty component file with no content.",
  "frontend/src/components/TransformationSection.tsx": "Empty component file with no content.",
  "frontend/src/components/WhatAreBackroomsSection.tsx": "Two-column section explaining the Backrooms concept, featuring a recovered hallway photo with scanline and corner-marker overlays alongside descriptive copy, with staggered fade-in on scroll.",
  "frontend/src/components/WhatWeEnhanceSection.tsx": "Empty component file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to set a visibility flag when a referenced element scrolls into view, enabling scroll-triggered animations.",
  "frontend/src/index.css": "Global CSS file defining a Backrooms/Dreamcore-themed design system with Tailwind directives, OKLCH CSS custom properties, typography utilities, grain/paper textures, and scroll animation classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a Backrooms/Dreamcore color palette using OKLCH values, custom font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file tracking the current version, summary, and existing features of a Backrooms/Dreamcore-themed website, replacing a previous Dark Fantasy landing page project."
}