{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Backrooms/Dreamcore theme, hero section, visual palette, etc.) to their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend file's purpose and content after the Backrooms/Dreamcore redesign.",
  "frontend/index.css": "Global CSS file with Tailwind directives and OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point titled 'Into The Backrooms' with liminal space meta/OG tags and Google Fonts imports for Special Elite, Share Tech Mono, and Inter.",
  "frontend/src/App.tsx": "Root React component assembling the Backrooms/Dreamcore site from NavBar, HeroSection, WhatAreBackroomsSection, LevelsSection, DreamcoreSection, SurvivalGuideSection, and Footer.",
  "frontend/src/components/BeforeAfterSlider.tsx": "Empty file — component has been removed as part of the Backrooms redesign.",
  "frontend/src/components/DreamcoreSection.tsx": "Section presenting the Dreamcore aesthetic with explanatory copy, a pull-quote, aesthetic tags, and a 2×2 image grid with hover caption overlays using pastel lavender/cyan accents.",
  "frontend/src/components/FAQSection.tsx": "Empty file — FAQ section removed during the Backrooms redesign.",
  "frontend/src/components/FinalCTASection.tsx": "Empty file — Final CTA section removed during the Backrooms redesign.",
  "frontend/src/components/Footer.tsx": "Footer rebranded to 'Into The Backrooms' with smooth-scroll navigation, system status readout, fan project disclaimer, flickering fluorescent accent line, and caffeine.ai attribution.",
  "frontend/src/components/GallerySection.tsx": "Empty file — Gallery section removed or cleared during the Backrooms redesign.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with 'You Weren't Supposed to Find This' headline, Backrooms background image, flickering fluorescent animations, dark vignette overlay, and an 'Enter' CTA button.",
  "frontend/src/components/HowItWorksSection.tsx": "Empty file — How It Works section removed during the Backrooms redesign.",
  "frontend/src/components/LevelsSection.tsx": "Renders a catalogue of four Backrooms levels (Level 0, Level 1, Level !, Poolrooms) as styled cards with images, descriptions, and danger tags. Uses IntersectionObserver to trigger staggered fade-in animations on scroll.",
  "frontend/src/components/NavBar.tsx": "Fixed top navigation bar with scroll-aware background blur, desktop nav links with hover effects, and a hamburger menu for mobile. Smooth-scrolls to section anchors on click.",
  "frontend/src/components/ParticleAnimation.tsx": "Canvas-based particle animation that renders floating gold and violet particles rising from the bottom of the canvas. Handles resize events and cleans up animation frames on unmount.",
  "frontend/src/components/PricingSection.tsx": "Empty file with no content.",
  "frontend/src/components/StickyCTA.tsx": "Empty file with no content.",
  "frontend/src/components/SurvivalGuideSection.tsx": "Displays a styled 'Survival Guide' section with five numbered tips compiled from survivor accounts. Uses IntersectionObserver for staggered fade-in animations.",
  "frontend/src/components/TestimonialsSection.tsx": "Empty file with no content.",
  "frontend/src/components/TransformationSection.tsx": "Empty file with no content.",
  "frontend/src/components/WhatAreBackroomsSection.tsx": "Two-column section explaining the Backrooms concept, featuring a recovered hallway image with scanline overlay and corner markers alongside descriptive copy. Animates children into view via IntersectionObserver.",
  "frontend/src/components/WhatWeEnhanceSection.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors. Invalidates and refetches dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Computer Internet Identity authentication, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to set a visibility flag when an element scrolls into view, enabling scroll-triggered animations.",
  "frontend/src/index.css": "Global CSS file defining a Backrooms/Dreamcore-themed design system with Tailwind directives, OKLCH color variables, custom utility classes for grain textures, liminal color helpers, and scroll-triggered fade-in animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with a Backrooms/Dreamcore color palette (fluorescent, liminal, void, pale-cyan, etc.), custom font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata file describing the current project as a Backrooms/Dreamcore aesthetic website, including versioning, required image assets, and a list of existing features carried over from a previous dark fantasy landing page project."
}