{
  "kind": "build_request",
  "title": "Add Timmy & Ricay survival tip attribution and code entry gate (2112)",
  "projectName": "Into The Backrooms",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Update the SurvivalGuideSection component to rebrand the section heading and attribution so it reads 'Timmy and Ricay's Survival Tips' (or styled variant like 'Timmy & Ricay's Survival Tips'). The five existing survival tips should remain unchanged in content; only the section title/byline attribution must reflect both names. Keep the existing distressed typewriter aesthetic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "put the names timmy and ricays survival tips"
        ]
      },
      "acceptanceCriteria": [
        "The SurvivalGuideSection heading or byline visibly includes both 'Timmy' and 'Ricay' as attributed authors of the survival tips",
        "The five original survival tip texts are unchanged",
        "The distressed monospace/typewriter styling is preserved"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Implement a full-screen code entry gate that blocks access to all site content until the user submits the correct code '2112'. When the site loads, display a full-screen overlay (matching the Backrooms/Dreamcore aesthetic — void black background, fluorescent accent, monospace font) with a prompt such as 'Enter Access Code' and a text input field plus a submit button. If the user submits '2112', dismiss the gate and reveal the site. If they submit an incorrect code, display an in-place error message (e.g., 'ACCESS DENIED') with a subtle flicker animation and keep the gate visible. The gate state should persist for the browser session (sessionStorage) so refreshing the page does not re-show the gate after a successful entry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "u haft to submit a code to enter and the code will be 2112"
        ]
      },
      "acceptanceCriteria": [
        "On first load, a full-screen overlay gate is displayed over all site content",
        "The gate is styled with Backrooms/Dreamcore palette (void black, fluorescent yellow-green accents, monospace font, grain texture)",
        "Submitting the code '2112' dismisses the gate and reveals the full site",
        "Submitting any incorrect code shows an 'ACCESS DENIED' error message and keeps the gate open",
        "On incorrect submission, a flicker or glitch animation plays on the error message",
        "After successful entry, the unlocked state is stored in sessionStorage so the gate does not reappear on page refresh within the same session",
        "The gate is fully responsive on mobile and desktop"
      ]
    }
  ],
  "constraints": [
    "The correct access code must be exactly '2112' — do not change it",
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui",
    "The five survival tip texts in SurvivalGuideSection must not be altered"
  ],
  "nonGoals": [
    "Backend authentication or server-side code verification",
    "Persistent login across sessions (localStorage long-term storage) — sessionStorage is sufficient",
    "Changing any other section content beyond the SurvivalGuideSection attribution"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}