{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Timmy & Ricay survival tip attribution and code entry gate (2112)",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Update SurvivalGuideSection to attribute survival tips to both 'Timmy and Ricay' while preserving existing tip content and distressed typewriter aesthetic",
      "acceptanceCriteria": [
        "The SurvivalGuideSection heading or byline visibly includes both 'Timmy' and 'Ricay' as attributed authors of the survival tips",
        "The five original survival tip texts are unchanged",
        "The distressed monospace/typewriter styling is preserved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SurvivalGuideSection.tsx",
          "operation": "modify",
          "description": "Update the section heading or byline to read 'Timmy & Ricay's Survival Tips' (or styled variant like 'Timmy and Ricay's Survival Tips'). Preserve the existing five survival tip texts exactly as-is. Maintain the current distressed monospace/typewriter font styling and IntersectionObserver animation behavior."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Implement a full-screen Backrooms-styled code entry gate that requires users to enter '2112' to access the site, with sessionStorage persistence",
      "acceptanceCriteria": [
        "On first load, a full-screen overlay gate is displayed over all site content",
        "The gate is styled with Backrooms/Dreamcore palette (void black, fluorescent yellow-green accents, monospace font, grain texture)",
        "Submitting the code '2112' dismisses the gate and reveals the full site",
        "Submitting any incorrect code shows an 'ACCESS DENIED' error message and keeps the gate open",
        "On incorrect submission, a flicker or glitch animation plays on the error message",
        "After successful entry, the unlocked state is stored in sessionStorage so the gate does not reappear on page refresh within the same session",
        "The gate is fully responsive on mobile and desktop"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CodeEntryGate.tsx",
          "operation": "create",
          "description": "Create a full-screen overlay component that prompts for an access code. On mount, check sessionStorage for a 'backrooms_access_granted' flag; if present, render nothing (unlocked state). Otherwise, render a fixed full-screen overlay with void black background, grain texture (via the existing CSS utility classes), and fluorescent accents. Display a prompt ('Enter Access Code'), a text input field, and a submit button styled with monospace font (Share Tech Mono or Special Elite) and Backrooms palette colors. On form submission, compare the entered code to '2112' (exact match). If correct, set sessionStorage 'backrooms_access_granted' to 'true' and update internal state to dismiss the overlay. If incorrect, display an inline 'ACCESS DENIED' error message with a brief flicker/glitch animation (e.g., rapid opacity or translateX keyframes) and keep the gate visible. Ensure the overlay is fully responsive using Tailwind utilities."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import the new CodeEntryGate component and render it as the first child inside the root App component, wrapping or preceding all other sections (NavBar, HeroSection, etc.). The CodeEntryGate component will conditionally render the overlay based on sessionStorage state, so no additional conditional logic is needed in App.tsx beyond the import and placement."
        }
      ]
    }
  ]
}